
export const modes = [
    {id:1,title:'Тренировка по главам ПДД',link:'/'},
    {id:2,title:'Тренировка по тематическим билетам',link:'/temBilet'},
    {id:3,title:'Тренировка по билету N',link:'/'},
    {id:4,title:'Тренировка по случайному билету',link:'/training'},
    {id:5,title:'Контроль по тематическим билетам',link:'/'},
    {id:6,title:'Контроль по билету N',link:'/'},
    {id:7,title:'Контроль по случайному билету x10',link:'/'},
    {id:8,title:'Контроль по случайному билету',link:'/'},
]

export const trainBiletMods = [
    {id:1,title:'Глава 1-6',link:'/'},
    {id:2,title:'Дорожные знаки, разметка, Приложение 2,3',link:'/'},
    {id:3,title:'Главы 7-13, Приложение 1',link:'/'},
    {id:4,title:'Главы 8-12 и 19',link:'/'},
    {id:5,title:'Главы 14-18, 20-25',link:'/'},
    {id:6,title:'Глава 26, Приложение 4, 5',link:'/'},
    {id:7,title:'Ответственность. Безопасность. Медицина',link:'/'},
]