
export const modes = [
    { id: 1, title: 'Тренировка по главам ПДД', link: '/allGlavs' },
    { id: 2, title: 'Тренировка по тематическим билетам', link: '/temBilet' },
    { id: 3, title: 'Тренировка по билету N', link: '/' },
    { id: 4, title: 'Тренировка по случайному билету', link: '/training' },
    { id: 5, title: 'Контроль по тематическим билетам', link: '/' },
    { id: 6, title: 'Контроль по билету N', link: '/' },
    { id: 7, title: 'Контроль по случайному билету x10', link: '/' },
    { id: 8, title: 'Контроль по случайному билету', link: '/' },
]

export const trainBiletMods = [
    { id: 1, title: 'Глава 1-6', link: '/training' },
    { id: 2, title: 'Дорожные знаки, разметка, Приложение 2,3', link: '/training' },
    { id: 3, title: 'Главы 7-13, Приложение 1', link: '/training' },
    { id: 4, title: 'Главы 8-12 и 19', link: '/training' },
    { id: 5, title: 'Главы 14-18, 20-25', link: '/training' },
    { id: 6, title: 'Глава 26, Приложение 4, 5', link: '/training' },
    { id: 7, title: 'Ответственность. Безопасность. Медицина', link: '/training' },
]

export const allGlavsMods = [
    { id: 1, title: 'Глава 1', label: 'Общие положения', tasks: 0 },
    { id: 2, title: 'Глава 2', label: 'Общие права и обязанности участников дорожного движения', tasks: 0 },
    { id: 3, title: 'Глава 3', label: 'Права и обязанности водителей', tasks: 0 },
    { id: 4, title: 'Глава 4', label: 'Права и обязанности пешеходов', tasks: 0 },
    { id: 5, title: 'Глава 5', label: 'Обязанности пассажиров', tasks: 0 },
    { id: 6, title: 'Глава 6', label: 'Права и обязанности водителей и других лиц в особых случаях', tasks: 0 },
    { id: 7, title: 'Глава 7', label: 'Сигналы регулировщика и светофоров', tasks: 0 },
    { id: 8, title: 'Глава 8', label: 'Применение аварийной световой сигнализации, знака аварийной остановки, фонаря с мигающим красным светом', tasks: 8 },
    { id: 9, title: 'Глава 9', label: 'Маневрирование', tasks: 0 },
    { id: 10, title: 'Глава 10', label: 'Расположение транспортных средств на проезжей части дороги', tasks: 0 },
    { id: 11, title: 'Глава 11', label: 'Скорость движения транспортных средств', tasks: 0 },
    { id: 12, title: 'Глава 12', label: 'Обгон, встречный разъезд', tasks: 0 },
    { id: 13, title: 'Глава 13', label: 'Проезд перекрестков', tasks: 0 },
    { id: 14, title: 'Глава 14', label: 'Пешеходные переходы, велосипедные переезды и остановочные пункты маршрутных транспортных средств', tasks: 0 },
    { id: 15, title: 'Глава 15', label: 'Преимущество маршрутных транспортных средст', tasks: 0 },
    { id: 16, title: 'Глава 16', label: 'Железнодорожные переезды', tasks: 0 },
    { id: 17, title: 'Глава 17', label: 'Движение по автомагистрали', tasks: 0 },
    { id: 18, title: 'Глава 18', label: 'Движение в жилой и пешеходной зонах, на прилегающей территории', tasks: 0 },
    { id: 19, title: 'Глава 19', label: 'Остановка и стоянка транспортных средств', tasks: 0 },
    { id: 20, title: 'Глава 20', label: 'Движение на велосипедах и мопедах', tasks: 0 },
    { id: 21, title: 'Глава 21', label: 'Движение гужевых транспортных средств, всадников и прогон скота', tasks: 0 },
    { id: 22, title: 'Глава 22', label: 'Пользование внешними световыми приборами и звуковыми сигналами транспортных средств', tasks: 0 },
    { id: 23, title: 'Глава 23', label: 'Перевозка пассажиров', tasks: 0 },
    { id: 24, title: 'Глава 24', label: 'Перевозка грузов', tasks: 0 },
    { id: 25, title: 'Глава 25', label: 'Буксировка механических транспортных средств', tasks: 0 },
    { id: 26, title: 'Глава 26', label: 'Основные положения о допуске транспортных средств к участию в дорожном движении, их техническое состояние, оборудование', tasks: 0 }
]