import pdd1 from '../../assets/bilets/pdd1.png'
import pdd2 from '../../assets/bilets/pdd2.png'
import pdd3 from '../../assets/bilets/pdd3.png'
import pdd4 from '../../assets/bilets/pdd4.png'
import pdd5 from '../../assets/bilets/pdd5.png'
import pdd6 from '../../assets/bilets/pdd6.png'
import pdd7 from '../../assets/bilets/pdd7.png'
import pdd8 from '../../assets/bilets/pdd8.png'
import pdd9 from '../../assets/bilets/pdd9.png'


export const questions = [
    {
        id: 1,
        answer: 1,
        img:pdd1,
        question: "По какой части тротуара в показанной ситуации должен двигаться пешеход при использовании моноколеса?",
        options: ["Только по левой части А", "Только по правой части Б", "По любой на усмотрение пешехода", "Движение пешехода на моноколесе по тротуару запрещено."]
    },
    {
        id: 2,
        answer: 1,
        img:pdd2,
        question: "В каких направлениях Вам разрешено продолжить движение на показанном перекрестке?",
        options: ["Только прямо", "Прямо или налево", "Прямо или на разворот", "Прямо,налево или на разворот"]
    },
    {
        id: 3,
        answer: 3,
        img:pdd3,
        question: "О чем предупреждает показанный дорожный знак?",
        options: ["Об участке дороги, имеющем неровности на проезжей части.", "Об участке дороги с усовершенствованным покрытием, на котором возможен выброс щебня из-под колёс транспортных средств. ", " О переходе дороги с усовершенствованным покрытием в гравийную или грунтовую дорогу.", " Об участке дороги с установленной искусственной неровностью (искусственными неровностями) на проезжей части дороги."]
    },
    {
        id: 4,
        answer: 2,
        img:pdd4,
        question: "Кто из водителей имеет преимущество в показанной ситуации на необозначенном перекрестке?",
        options: ["Водитель автобуса, движущегося по дороге с гравийным покрытием.", " Вы, управляя легковым автомобилем, движущимся по дороге с асфальтобетонным покрытием."]
    },
    {
        id: 5,
        answer: 1,
        img:pdd5,
        question: "В каком месте Вы должны остановиться в показанной ситуации?",
        options: ["Перед светофором.", "Перед краем пересекаемой проезжей части дороги.",]
    },
    {
        id: 6,
        answer: 2,
        img:pdd6,
        question: "Нарушит ли Правила водитель легкового автомобиля при постановке его на стоянку в указанном месте таким образом?",
        options: ["Нарушит.", "Не нарушит, если эти действия не создадут препятствия для других участников дорожного движения и будет обеспечена безопасность дорожного движения.", ]
    },
    {
        id: 7,
        answer: 1,
        img:pdd7,
        question: "Разрешено ли Вам выполнить опережение грузового автомобиля в показанной ситуации?",
        options: ["Разрешено", "Запрещено", ]
    },
    {
        id: 8,
        answer: 2,
        img:pdd8,
        question: "Должны ли Вы уступить дорогу автомобилю-такси, начинающему движение от обозначенного остановочного пункта маршрутных транспортных средств?",
        options: ["Должны", "Не должны", ]
    },
    {
        id: 9,
        answer: 1,
        img:pdd9,
        question: "Механическое транспортное средство, обозначенное показанным опознавательным знаком, не может двигаться со скоростью, превышающей:",
        options: ["30 км/ч", "40 км/ч", "50 км/ч", "60 км/ч"]
    },
    {
        id: 10,
        answer: 1,
        question: "Как влияет утомление на внимание и реакцию водителя?",
        options: ["Внимание и реакция снижаются", "Внимание и реакция повышаются", "Внимание и рекция не изменяются"]
    }
];
